In [1]:
import numpy as np 
import pandas as pd

Finding Missing Data

In [9]:
data = {
    'A':[1,2,np.nan,4,5],
    'B':[np.nan,2,3,4,5],
    'C':[1,np.nan,np.nan,np.nan,5]
}

df = pd.DataFrame(data)
df

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  NaN
2  NaN  3.0  NaN
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [12]:
df.isna()

       A      B      C
0  False   True  False
1  False  False   True
2   True  False   True
3  False  False   True
4  False  False  False

In [17]:
df.isna().sum()

A    1
B    1
C    3
dtype: int64

 to check if any NaN value is present in each column

In [ ]:
df.isna().any()  # by default axis = 0)

A    True
B    True
C    True
dtype: bool

In [15]:
df.isnull()

       A      B      C
0  False   True  False
1  False  False   True
2   True  False   True
3  False  False   True
4  False  False  False

In [16]:
df.notnull()

       A      B      C
0   True  False   True
1   True   True  False
2  False   True  False
3   True   True  False
4   True   True   True

Removing Missing Data

In [24]:
# drop all rows that have any NaN values
df.dropna()

     A    B    C
4  5.0  5.0  5.0

In [ ]:
df.dropna(thresh=3) # at least 3 non NaN values in the row

     A    B    C
4  5.0  5.0  5.0

Filling the missing data

In [27]:
df

     A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  NaN
2  NaN  3.0  NaN
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [30]:

df_filled = df.fillna(0) ## permanently changes it use inplace =True
df_filled

     A    B    C
0  1.0  0.0  1.0
1  2.0  2.0  0.0
2  0.0  3.0  0.0
3  4.0  4.0  0.0
4  5.0  5.0  5.0

In [34]:
values={'A':100,'B':200,'C':300}
df.fillna(values)

       A      B      C
0    1.0  200.0    1.0
1    2.0    2.0  300.0
2  100.0    3.0  300.0
3    4.0    4.0  300.0
4    5.0    5.0    5.0

In [36]:
# fill with mean
df.fillna(df.mean())

     A    B    C
0  1.0  3.5  1.0
1  2.0  2.0  3.0
2  3.0  3.0  3.0
3  4.0  4.0  3.0
4  5.0  5.0  5.0